// 1. 이벤트
// 1.1 브라우저에서 발생하는 사용자 상호 작용을 의미

// 2. 이벤트 주요 구성 요소
// 2.1 이벤트 타겟, 이벤트 타입, 이벤트 핸들러

// 3. 이벤트 등록
// 3.1 addEventListener(이벤트 타입, 이벤트 핸들러, 옵션(객체))

// 4. 이벤트 전파
// 4.1 이벤트가 발생했을 때 이벤트가 전달되는 현상

// 4.2 이벤트 전파의 단계
// 4.2.1 캡쳐링 단계 -> 이벤트가 이벤트 타겟까지 내려가면서 전달되는 현상
//  Window 객체 부터 이벤트 타겟까지 내려가면서 클릭 이벤트 전달. 기본적으로 비활성화 의도하지 않는 이상 동작 X
// 4.2.2 타깃 단계 -> 실제 이벤트가 발생하는 단계
// 4.2.3 버블링 단계 -> 타깃 요소로부터 시작해 상위로 올라가면서 전달되는 단계
//  이벤트 타겟부터 Window 객체까지 올라가면서 클릭 이벤트 전달.
// 모든 동작은 이벤트가 발생. 그것을 addEventLister로 활용하는 것
